tap "common-fate/granted"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "jpeg-xl"
brew "git"
brew "asdf"
brew "icu4c@77"
brew "node"
brew "aws-cdk"
brew "python@3.13"
brew "awscli"
brew "bat"
brew "cowsay"
brew "ctags"
brew "ctop"
brew "ddgr"
brew "dfu-programmer"
brew "dfu-util"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "dry"
brew "fd"
brew "unbound"
brew "ffmpeg"
brew "figlet"
brew "fswatch"
brew "fzf"
brew "gh"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gradle"
brew "htop"
brew "httpie"
brew "icu4c@76"
brew "ifstat"
brew "imagemagick"
brew "jo"
brew "jq"
brew "jump"
brew "kafka"
brew "killport"
brew "kotlin"
brew "lazygit"
brew "lolcat"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "pinentry-mac"
brew "poetry"
brew "pyenv"
brew "pyenv-virtualenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "showkey"
brew "solargraph"
brew "sqlc"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "typescript"
brew "urlview"
brew "vim"
brew "virtualenv"
brew "wallpaper"
brew "watch"
brew "wget"
brew "zsh"
brew "common-fate/granted/granted"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
cask "1password-cli"
cask "aerospace"
cask "alacritty"
cask "alfred"
cask "chromedriver"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "fork"
cask "gcloud-cli"
cask "gifox"
cask "github"
cask "itsycal"
cask "jetbrains-toolbox"
cask "monodraw"
cask "orbstack"
cask "postico"
cask "postman"
cask "qmk-toolbox"
cask "session-manager-plugin"
cask "shortcat"
cask "slack"
cask "visual-studio-code"
cask "yubico-yubikey-manager"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esafirm.kotlin-formatter"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "jacano.vscode-pnpm"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kumar-harsh.graphql-for-vscode"
vscode "linbudu.pnpm-vscode-helper"
vscode "mathiasfrohlich.kotlin"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "orta.vscode-jest"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "premparihar.gotestexplorer"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r-syntax"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "stylelint.vscode-stylelint"
vscode "techer.open-in-browser"
vscode "testdouble.vscode-standard-ruby"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "vayan.haml"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.codetour"
vscode "wayou.vscode-todo-highlight"
vscode "xadillax.viml"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
