tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "1password/tap"
brew "asdf"
brew "awscli"
brew "aws-cdk"
brew "bat"
brew "calc"
brew "coreutils"
brew "ctags"
brew "ctop"
brew "ddgr"
brew "dfu-programmer"
brew "dfu-util"
brew "direnv"
brew "figlet"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "gopls"
brew "gradle"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "itsycal"
brew "jenv"
brew "jo"
brew "jq"
brew "links"
brew "maven"
brew "meetingbar"
brew "neovim"
brew "nmap"
brew "nnn"
brew "nvm"
brew "pinentry-mac"
brew "poetry"
brew "postgres"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "showkey"
brew "skhd"
brew "starship"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "typescript"
brew "urlview"
brew "vim"
brew "wallpaper"
brew "watch"
brew "wget"
brew "yabai"
brew "yarn"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "aws-vault"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "fantastical"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "fork"
cask "gifox"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "hey"
cask "hyper"
cask "insomnia"
cask "istat-menus"
cask "kindle"
cask "launchbar"
cask "little-snitch"
cask "micro-snitch"
cask "miro"
cask "monodraw"
cask "notion"
cask "openvpn-connect"
cask "postico"
cask "postman"
cask "qmk-toolbox"
cask "sketch"
cask "skype"
cask "slack"
cask "spotify"
cast "soundsource"
cask "steam"
cask "the-unarchiver"
cask "virtualbox"
cask "visual-studio-code"
cask "zoom"
