tap "1password/tap"
tap "cultureamp/tap", "git@github.com:cultureamp/homebrew-tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "moncho/dry"
tap "osx-cross/arm"
tap "osx-cross/avr"
brew "openssl@3"
brew "apr-util"
brew "coreutils"
brew "asdf"
brew "boost"
brew "node"
brew "aws-cdk"
brew "awscli"
brew "bat"
brew "glib"
brew "python@3.9"
brew "calc"
brew "chezmoi"
brew "cointop"
brew "ctags"
brew "ctop"
brew "python@3.10"
brew "ddgr"
brew "dfu-programmer"
brew "dfu-util"
brew "diff-so-fancy"
brew "direnv"
brew "exercism"
brew "fd"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libarchive"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gcc"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "gnupg"
brew "gobject-introspection"
brew "golangci-lint"
brew "goose"
brew "gradle"
brew "htop"
brew "httpie"
brew "libheif"
brew "imagemagick"
brew "jenv"
brew "jo"
brew "jq"
brew "jump"
brew "killport"
brew "krb5"
brew "ktlint"
brew "lazygit"
brew "libraqm"
brew "librsvg"
brew "links"
brew "maven"
brew "neovim"
brew "nghttp2"
brew "nmap"
brew "nvm"
brew "tmux"
brew "overmind"
brew "tcl-tk"
brew "pillow"
brew "pinentry-mac"
brew "pnpm"
brew "virtualenv"
brew "poetry"
brew "postgresql@13", restart_service: true
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "showkey"
brew "solargraph"
brew "sqlc"
brew "starship"
brew "subversion"
brew "swagger-codegen"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmuxinator"
brew "tree"
brew "typescript"
brew "urlview"
brew "vim"
brew "wallpaper"
brew "watch"
brew "wget"
brew "yarn"
brew "zsh"
brew "cultureamp/tap/silk-cli"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "moncho/dry/dry"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "aws-vault"
cask "browserstacklocal"
cask "chromedriver"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "firefox-developer-edition"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "fork"
cask "gifox"
cask "github"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "hyper"
cask "insomnia"
cask "istat-menus"
cask "itsycal"
cask "jetbrains-toolbox"
cask "kindle"
cask "krisp"
cask "launchbar"
cask "little-snitch"
cask "loom"
cask "meetingbar"
cask "mic-drop"
cask "micro-snitch"
cask "miro"
cask "monodraw"
cask "mpv"
cask "nordvpn"
cask "notion"
cask "openvpn-connect"
cask "postico"
cask "postman"
cask "qmk-toolbox"
cask "remarkable"
cask "robo-3t"
cask "safari-technology-preview"
cask "sequel-pro"
cask "sketch"
cask "skype"
cask "slack"
cask "soundsource"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "virtualbox"
cask "visual-studio-code"
cask "wkhtmltopdf"
cask "yubico-yubikey-manager"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "andys8.jest-snippets"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "CodeSandbox-io.codesandbox-projects"
vscode "cschlosser.doxdocgen"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "foxundermoon.shell-format"
vscode "fwcd.kotlin"
vscode "gamunu.vscode-yarn"
vscode "golang.go"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jpoissonnier.vscode-styled-components"
vscode "karunamurti.haml"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "patbenatar.advanced-new-file"
vscode "pflannery.vscode-versionlens"
vscode "PKief.material-icon-theme"
vscode "pnp.polacode"
vscode "Prisma.prisma"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "techer.open-in-browser"
vscode "tinkertrain.theme-panda"
vscode "toba.vsfire"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vsls-contrib.codetour"
vscode "wayou.vscode-todo-highlight"
vscode "wingrunr21.vscode-ruby"
vscode "yzhang.markdown-all-in-one"
vscode "Zignd.html-css-class-completion"
